changes architecture in readme
